
  class String
    def to_cuneiform
      # TODO add alphabet
      hash = {
        # Alphabet
        a: ['12001'], b: [''], c: [''], d: [''], e: [''], f: [''], g: [''], h: [''], i: [''], j: [''], k: [''], l: [''], m: [''],
        n: [''], o: [''], p: [''], q: [''], r: [''], s: [''], t: [''], u: [''], v: [''], w: [''], x: [''], y: [''], z: [''],

        # Japanese Hiragana
        あ: ['12000'], い: ['1213F'], う: ['1230B'], え: ['1208A'], お: ['120F0'],
        か: ['12157'], き: ['121A0'], く: ['121AA'], け: ['121A0'], こ: ['120F0'],
        さ: ['12293'], し: ['122EB'], す: ['122E2'], せ: ['122EB'], そ: %w[12047 1202D],
        た: ['122EB'], ち: ['122FE'], つ: ['12305'], て: ['122FC'], と: ['12317'],
        な: ['1223E'], に: ['1224C'], ぬ: ['12261'], ね: ['12248'], の: ['12056'],
        は: ['12129'], ひ: ['1212D'], ふ: ['12137'], へ: ['1212D'], ほ: ['1219D'],
        ま: ['12220'], み: ['1222A'], む: ['1222C'], め: ['12228'], も: ['12172'],
        や: ['1227E'], ゆ: ['1227E'], よ: ['1227E'],
        ら: ['1228E'], り: ['12291'], る: ['12292'], れ: ['12291'], ろ: ['12112'],
        わ: ['1227E'], を: ['12240'], ん: ['12158'],
      }

      # TODO add japanese

      # TODO add number

      result = []
      strings = split('')
      strings.each do |str|
        hash[str.to_sym] ? temp = hash[str.to_sym].join : temp = nil
        temp ? result << [temp.hex].pack("U") : result << str
      end
      result.join
    end


  end